In [1]:
#--------------------------------------
# PANDAS - Tutorial X1PAN07 2021/07/097        
#---------------------------------------
import pandas as pd
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

In [2]:
data = {'País': ['Bélgica', 'Índia', 'Brasil'],
'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
'População': [123465, 456789, 987654]}

In [3]:
data

{'País': ['Bélgica', 'Índia', 'Brasil'],
 'Capital': ['Bruxelas', 'Nova Delhi', 'Brasília'],
 'População': [123465, 456789, 987654]}

In [4]:
df = pd.DataFrame(data, columns=['País','Capital','População'])

In [5]:
df.head()

      País     Capital  População
0  Bélgica    Bruxelas     123465
1    Índia  Nova Delhi     456789
2   Brasil    Brasília     987654

In [6]:
s.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [7]:
df1 = pd.read_csv('chips.txt', encoding='UTF-8', sep=';')

In [8]:
df1.head(2)

  order_id\tquantity\titem_name\tchoice_description\titem_price
0   1\t1\tChips and Fresh Tomato Salsa\tNULL\t$2.39
1                   1\t1\tIzze\t[Clementine]\t$3.39

In [9]:
#Para gravar arquivos CSV
df1.to_csv('gravar.csv')

In [10]:
df2 = pd.read_csv('gravar.csv', encoding='UTF-8', sep=';')
df2

     ,order_id\tquantity\titem_name\tchoice_description\titem_price
0     0,1\t1\tChips and Fresh Tomato Salsa\tNULL\t$2...
1                    1,1\t1\tIzze\t[Clementine]\t$3.39
2             2,1\t1\tNantucket Nectar\t[Apple]\t$3.39
3     3,1\t1\tChips and Tomatillo-Green Chili Salsa\...
4     4,"2\t2\tChicken Bowl\t[Tomatillo-Red Chili Sa...
...                                                 ...
4617  4617,"1833\t1\tSteak Burrito\t[Fresh Tomato Sa...
4618  4618,"1833\t1\tSteak Burrito\t[Fresh Tomato Sa...
4619  4619,"1834\t1\tChicken Salad Bowl\t[Fresh Toma...
4620  4620,"1834\t1\tChicken Salad Bowl\t[Fresh Toma...
4621  4621,"1834\t1\tChicken Salad Bowl\t[Fresh Toma...

[4622 rows x 1 columns]

In [11]:
# Removendo colunas utilizando o argumento axis=1
df.drop('País', axis=1)

      Capital  População
0    Bruxelas     123465
1  Nova Delhi     456789
2    Brasília     987654

In [12]:
# Quantidade de linhas e colunas do DataFrame
df.shape

(3, 3)

In [13]:
# Descrição do Index
df.index

RangeIndex(start=0, stop=3, step=1)

In [14]:
# Colunas presentes no DataFrame
df.columns

Index(['País', 'Capital', 'População'], dtype='object')

In [16]:
#Contagem de dados não-nulos
df.count()

País         3
Capital      3
População    3
dtype: int64

In [17]:
#Criando uma nova coluna em um DataFrame:
df['Nova Coluna'] = 0

In [18]:
#Renomeando colunas de um DataFrame:
#Se seu DataFrame possui 3 colunas, passe 3 novos valores em uma lista
df.columns = ['Coluna 1', 'Coluna 2', 'Coluna 3','Coluna 4']

In [19]:
df.columns

Index(['Coluna 1', 'Coluna 2', 'Coluna 3', 'Coluna 4'], dtype='object')

In [20]:
#Resumo dos dados:
#Soma dos valores de um DataFrame
df.sum()

Coluna 1            BélgicaÍndiaBrasil
Coluna 2    BruxelasNova DelhiBrasília
Coluna 3                       1567908
Coluna 4                             0
dtype: object

In [22]:
#Menor valor de um DataFrame
df.min()

Coluna 1      Brasil
Coluna 2    Brasília
Coluna 3      123465
Coluna 4           0
dtype: object

In [35]:
#Maior valor
df.max()

Coluna 1         Índia
Coluna 2    Nova Delhi
Coluna 3        987654
Coluna 4             0
dtype: object